#PZ_4_1
#Даны два целых числа A и B (A < B). Вывести в порядке возрастания все целые
#числа, расположенные между A и B (включая сами числа A и B), а также количество 
#N этих чисел

while True: #работает пока не введут правильное значение
  try:
    a = int(input("Число А: "))
    b = int(input("Число В: "))
    if a >= b: #По условиям программы А строго меньше В, нне равно и не больше
      print("Введены неправильные значения, А строго меньше В!")
      continue
    break
  except ValueError:
    print("Неправильное значение")

n = 0 #переменная считающая количество чисел между а и б
while a <= b:
  print(a)
  n += 1
  a += 1 #каждый прошедший цикл +1 что под считывает их и следовательно количество цифр между а и б

print(f"количество чисел между а и б: {n}")
