#1 вариант
candy = int(input("сколько килограмм конфет?: ")) #просит вес конфет, int выберает что можно ввести только цифру
price = int(input("сколько вы заплатили за них?: ")) #узнает цены за конфеты
candy_two = int(input("сколько вы еще хотите взять?: ")) #узнает значение новых купленных конфет
price_one_kg = price / candy #вычесляет цену за 1 кг конфет
print(f"Цена за 1 кг конфект: {price_one_kg}, за взятые {candy_two} кг конфет вы платите {candy_two * price_one_kg}")
#выводит разом цену за 1 кг конфет и за новые взятые
