#1 вариант
while True:  #цикл работает пока значение остается неправильным
    try:
        candy = int(input("сколько килограмм конфет?: ")) #просит вес конфет, int выберает что можно ввести только цифру
        if candy <= 0: #защита от неправильных значений конфет и сломанного вычесления(деление на 0)
            print("Вы ввели что количество взятых конфет 0 или отрицательное, поменяйте значение для вычеслений")
            continue
        break
    except ValueError:
        print("Ошибка: нужно ввести целое число, а не буквы или символы. Попробуйте снова.")

while True:  #цикл работает пока значение неправильное
    try:
        price = int(input("сколько вы заплатили за конфеты?: ")) #узнает цены за конфеты
        if price <= 0: #защита от неправильной цены
            print("Значение цены не может быть ноль  или отрицательное, введите новое")
            continue
        break
    except ValueError:
        print("Ошибка: нужно ввести целое число, а не буквы или символы. Попробуйте снова.")

while True:
    try:
        candy_two = int(input("сколько вы еще хотите взять?: ")) #узнает значение новых купленных конфет
        # нового цикла нет поскольку значение 0 не ломает какие либо вычесления и допускается что конфет не взяли.
        if candy_two < 0:
            print("Количество не может быть отрицательным, введите новое")
            continue
        break
    except ValueError:
        print("Ошибка: нужно ввести целое число, а не буквы или символы. Попробуйте снова.")

price_one_kg = price / candy #вычесляет цену за 1 кг конфет
print(f"Цена за 1 кг конфект: {price_one_kg}, за взятые {candy_two} кг конфет вы платите {candy_two * price_one_kg}")
#выводит разом цену за 1 кг конфет и за новые взятые
