#PZ_4_2
#Даны положительные числа A, B, C. На прямоугольнике размера A х B размещено 
#максимальное возможное количество квадратов со стороной С(без наложений)
#Найти количество квадратов, размещены на прямоугольник. операции
#умножение и деление не использовать

while True: #работает пока не введут правильное значение
  try:
    a = int(input("Число А: "))
    b = int(input("Число В: "))
    c = int(input("Число С: ")) 
    break
  except ValueError:
    print("Неправильное значение")

if c > a or c > b:
  print("тут не может поместиться ни один квадрат")
else:
  sqare = 0 #количество квадратов
  sqare_a = 0 #количество квадратов по стороне а
  sqare_b = 0 #количество квадратов по стороне б
  while a >= c: #подсчёт сколько квадратов может поместиться на стороне а
    a -= c
    sqare_a += 1

  while b >= c: #подсчёт сколько квадратов может поместиться на стороне б
    b -= c
    sqare_b += 1

  while sqare_b >0: #подсчёт общего количества квадратов
    sqare += sqare_a
    sqare_b -= 1

  print(f"количество квадратов: {sqare}")
